IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI4_MCSPI4.xml
	<register id="MCSPI4_SYSSTATUS" acronym="MCSPI4_SYSSTATUS" offset="0x114" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reserved for module specific status information Read returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="Internal Reset Monitoring" range="0" rwaccess="RO"/>
	</register>
	<register id="MCSPI4_IRQSTATUS" acronym="MCSPI4_IRQSTATUS" offset="0x118" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads returns 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW" width="1" begin="17" end="17" resetval="0x0" description="End of word count event when a channel is enabled using the FIFO buffer and the channel had sent the number of SPI word defined by MCSPI_XFERLEVEL[WCNT]" range="17" rwaccess="RW"/> 
		<bitfield id="WKS" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL" width="1" begin="14" end="14" resetval="0x0" description="Receiver register is full or almost full Only when Channel 3 is enabled" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register underflow Only when Channel 3 is enabled The transmitter register is empty [not updated by Host or DMA with new data] before its time slot assignment Exception: No TX_underflow event when no data has been loaded into the transmitter register since channel has been enabled" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register is empty or almost empty Note: Enabling the channel automatically rises this event" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads returns 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL" width="1" begin="10" end="10" resetval="0x0" description="Receiver register full or almost full Channel 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register underflow Channel 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register empty or almost empty Channel 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads returns 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL" width="1" begin="6" end="6" resetval="0x0" description="Receiver register full or almost full Channel 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register underflow Channel 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register empty or almost empty Channel 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW" width="1" begin="3" end="3" resetval="0x0" description="Receiver register overflow [slave mode only] Channel 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL" width="1" begin="2" end="2" resetval="0x0" description="Receiver register full or almost full Channel 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register underflow Channel 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register empty or almost empty Channel 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI4_IRQENABLE" acronym="MCSPI4_IRQENABLE" offset="0x11C" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads return 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="End of Word count Interrupt Enable" range="17" rwaccess="RW"/> 
		<bitfield id="WKE" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event interrupt Enable in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL_ENABLE" width="1" begin="14" end="14" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 3" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW_ENABLE" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 3" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY_ENABLE" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch3" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads return 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads return 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW_ENABLE" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="Receiver register Overflow Interrupt Enable Ch 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI4_WAKEUPENABLE" acronym="MCSPI4_WAKEUPENABLE" offset="0x120" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reads returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="WKEN" width="1" begin="0" end="0" resetval="0x0" description="WakeUp functionality in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI4_SYST" acronym="MCSPI4_SYST" offset="0x124" width="32" description="">
		<bitfield id="RESERVED" width="20" begin="31" end="12" resetval="0x0" description="Reads returns 0" range="31 - 12" rwaccess="RO"/> 
		<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bit" range="11" rwaccess="RW"/> 
		<bitfield id="SPIENDIR" width="1" begin="10" end="10" resetval="0x0" description="Set the direction of the SPIEN[3:0] lines and SPICLK line" range="10" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR1" width="1" begin="9" end="9" resetval="0x0" description="Set the direction of the SPIDAT[1]" range="9" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR0" width="1" begin="8" end="8" resetval="0x0" description="Set the direction of the SPIDAT[0]" range="8" rwaccess="RW"/> 
		<bitfield id="WAKD" width="1" begin="7" end="7" resetval="0x0" description="SWAKEUP output [signal data value of internal signal to system] The signal is driven high or low according to the value written into this register bit" range="7" rwaccess="RW"/> 
		<bitfield id="SPICLK" width="1" begin="6" end="6" resetval="0x0" description="SPICLK line [signal data value] If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the CLKSPI line [high or low], and a write into this bit has no effect If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the CLKSPI line is driven high or low according to the value written into this register" range="6" rwaccess="RW"/> 
		<bitfield id="SPIDAT_1" width="1" begin="5" end="5" resetval="0x0" description="SPIDAT[1] line [signal data value] If MCSPI_SYST[SPIDATDIR1] = 0 [output mode direction], the SPIDAT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR1] = 1 [input mode direction], this bit returns the value on the SPIDAT[1] line [high or low], and a write into this bit has no effect" range="5" rwaccess="RW"/> 
		<bitfield id="SPIDAT_0" width="1" begin="4" end="4" resetval="0x0" description="SPIDAT[0] line [signal data value] If MCSPI_SYST[SPIDATDIR0] = 0 [output mode direction], the SPIDAT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR0] = 1 [input mode direction], this bit returns the value on the SPIDAT[0] line [high or low], and a write into this bit has no effect" range="4" rwaccess="RW"/> 
		<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="RW"/> 
		<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="RW"/> 
		<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="RW"/>
	</register>
